csn6666/tianji-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 自定义分区表:app 扩到 3MB(中文字体 + Wi-Fi 栈超出默认 1MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 深空鎏金皮肤对象多(星空+印章角+小道童),24KB 会在建菜单时耗尽而崩溃,取 48KB。
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# 全覆盖 28px 书法字库字模偏移超 16 位,需开大字库格式
CONFIG_LV_FONT_FMT_TXT_LARGE=y

# 中文显示(Chat 页):LVGL 内置宋体 CJK 子集
# (改用自带 main/font_cn_16.c 全覆盖字体,内置 CJK 字体字数不足已弃用)

# --- Wi-Fi(Chat 页语音交互用)---
# C3 无 PSRAM,压缩收发缓冲给音频/LVGL 留内存
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
CONFIG_ESP_WIFI_RX_BA_WIN=6
# 加大 TCP 发送缓冲:录音上行 32KB/s,默认 5.7KB 缓冲只扛得住 180ms 拥塞,
# 跨境链路抖动会直接把 ws 连接憋死。16KB 可扛约 0.5 秒。
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# 授时:排盘的流年/流月/流日要靠它(设备无 RTC)。两个源,主用国内的。
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# ── TLS 内存(设备直连 LLM 用)──
# C3 没有 PSRAM,空闲堆只有 ~50KB。默认 16KB 的收缓冲常驻会直接把堆吃穿,
# 开动态缓冲让 mbedTLS 在空闲时把大块还回去;收缓冲也砍到 8KB。
# 若某个 API 端点发超过 8KB 的 TLS 记录导致握手失败,把这个值调回 16384。
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
